app/controllers/students_controller.rb

    def create
        @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Justin"], ["last_name", "Timberlake"], ["created_at", "2020-05-29 19:46:05.050129"], ["updated_at", "2020-05-29 19:46:05.050129"]]

    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Demi"], ["last_name", "Lovato"], ["updated_at", "2020-05-30 05:29:49.828401"], ["id", 5]]